# Copy Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ThermalAsset..::..Copy Method
ThermalAsset Class See Also
---
Produces a copy of the asset.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ThermalAsset Copy()
```

Visual Basic
---
```text
Public Function Copy As ThermalAsset
```

Visual C++
---
```text
public:
ThermalAsset^ Copy()
```

# ### Return Value
A copy of the asset.
# See Also
ThermalAsset Class
Autodesk.Revit.DB Namespace